# -*- coding: utf-8 -*-
# функция is_palindrome(num) должна принимать на вход строку
# и определять, является ли строка палиндромом, возвращая True или False
# если переданный аргумент пустой, функция должна бросать исключение ValueError
# регистр имеет значение

# Команда для проверки работы скрипта: pytest -k 01 -v
# Не забудь перед проверкой запустить скрипт, проверяется всегда его последняя запущенная версия!


def is_palindrome(argument):
    # здесь решение
    return #здесь значение, которое мы возвращаем


if __name__ == "__main__":
    print(is_palindrome(input('нужно передать строку ')))
