# -*- coding: utf-8 -*-
# функция do_fibonacci(number) должна принимать на вход число
# и возвращать список элементов последовательности фибоначчи
# где количество элементов = переданному числу
# если аргумент <1 - функция должна бросать ValueError
# если аргумент не является числом - функция должна бросать ValueError
# если аргумент пустой - функция должна бросать TypeError


# Команда для проверки работы скрипта: pytest -k 02 -v
# Не забудь перед проверкой запустить скрипт,
# проверяется его последняя запущенная версия!


def do_fibonacci(argument):
    # здесь решение
    return  # здесь слисок элементов, который мы возвращаем


if __name__ == "__main__":
    print(do_fibonacci(input('нужно передать число ')))
